
horario=[
 "[1] 07:30 às 08:30",                                                  
 "[2] 08:30 às 09:20",                                                  
 "[3] 09:50 às 10:40",        
 "[4] 10:40 às 11:30",
 "[5] 13:00 às 13:50",
 "[6] 13:50 às 14:40",
 "[7] 15:00 às 15:50",
 "[8] 15:50 às 16:40",
 "[9] 18:30 às 19:20",
 "[10] 19:20 às 20:10",
 "[11] 20:30 às 21:20",
 "[12] 21:20 às 22:10",
 "[13]22:10 às 23:00",                  
 ]       
                                           
opcao=int(input('''
╔═══════════════════════════════════════════════════════════════╗
║    Horários de Reserva de Laboratórios, Salas e Auditórios    ║
║                                                               ║
╠═══════════════════════════════════════════════════════════════╣
║   Manhã                                                       ║
║   [1] 07:30 às 08:30                                          ║     
║   [2] 08:30 às 09:20                                          ║      
║   [3] 09:50 às 10:40                                          ║
║   [4] 10:40 às 11:30                                          ║
║                                                               ║
║    Tarde                                                      ║
║   [5] 13:00 às 13:50                                          ║
║   [6] 13:50 às 14:40                                          ║
║   [7] 15:00 às 15:50                                          ║
║   [8] 15:50 às 16:40                                          ║
║                                                               ║
║    Noite                                                      ║
║   [9] 18:30 às 19:20                                          ║
║   [10] 19:20 às 20:10                                         ║
║   [11] 20:30 às 21:20                                         ║
║   [12] 21:20 às 22:10                                         ║
║   [13] 22:10 às 23:00                                         ║                           
╚═══════════════════════════════════════════════════════════════╝
Digite o número referente ao horário que deseja reservar:'''))



def reservar_horario (opcao):
    if opcao >=1 and opcao<=13:
        escolha = opcao - 1
        print("Seu horário foi reservado com sucesso!")
        print(horario[escolha])


    else:
        print("Opção Inválida")


reservar_horario(opcao)

